export const termsOfService = `   1. 개인정보 처리방침
회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
    1)  홈페이지 회원가입 및 관리
회원 가입의사 확인 목적으로 개인정보를 처리합니다.
    2)   민원사무 처리
민원인의 신원 확인 목적으로 개인정보를 처리합니다.
    3)  재화 또는 서비스 제공
콘텐츠 제공을 목적으로 개인정보를 처리합니다.
    4)  마케팅 및 광고에의 활용
접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.

    2. 익명 시스템

익명 시스템이란, 회원가입과 학교 인증 시 입력한 모든 정보를 일방향 암호화하여 본인을 확인할 수 없게 하는 보안 체계를 의미합니다.
익명으로 처리된 개인정보는 복원할 수 없으므로, 회원의 개인정보를 제 3자에게 제공하는 것은 원칙적으로 불가능합니다. 그러므로 익명으로 게시글을 작성할 경우 어떠한 경우에도 다른 이용자에게 이름, 닉네임, 학번 등의 정보가 전달되지 않습니다.

    3. 수집하는 개인정보의 항목
회사는 서비스 제공을 위해 아래 항목 중 최소한의 개인정보를 수집합니다.
    1) 회원가입을 할 경우
    • 학교, 아이디, 이메일, 이름, 캠퍼스, 단과대학, 학과, 입학년도, 프로필 사진, 타 서비스 로그인 고유번호
    2) 학교인증을 할 경우
    • 학교 메일
※ 각 항목 또는 추가적으로 수집이 필요한 개인정보 및 개인정보를 포함한 자료는 이용자 응대 과정과 서비스 내부 알림 수단 등을 통해 별도로 수집, 요청될 수 있습니다.
※ 서비스 이용 과정에서 기기 정보, 이용 기록, 로그 기록 등이 자동으로 수집될 수 있습니다.
    4. 수집하는 개인정보의 이용
회사는 쾌적한 서비스를 제공하기 위해 아래의 목적에 한해 개인정보를 이용합니다.
    • 가입 및 탈퇴 의사 확인, 회원 식별
    • 서비스 제공 및 시스템 개선
    • 통계학적 자료 분석을 통한 맞춤형 콘텐츠 제공

    5. 개인정보의 제 3자 제공 및 처리 위탁
회사는 관련법 및 회원의 동의가 없는 한, 회원에 개인정보를 제 3자에게 절대 제공하지 않습니다. 단, 회사는 보안성 높은 서비스 제공을 위하여 신뢰도가 검증된 아래 회사에 개인정보 관련 업무를 위탁할 수 있습니다. 이 경우 회사는 회원에게 위탁을 받는 자와 업무의 내용을 사전에 알리고 동의를 받습니다. 위탁을 받는 자 또는 업무의 내용이 변경될 경우에도 같습니다.
회사는 정보통신서비스의 제공에 관한 계약을 이행하고 회원의 편의 증진 등을 위하여 추가적인 처리 위탁이 필요한 경우에는 고지 및 동의 절차를 거치지 않을 수 있습니다.
    1) Amazon Web Service: 서비스 시스템 제공, 데이터 관리 및 보관
    2) Google Cloud Platform: 소셜 로그인 지원, 운영 시스템 지원
    3) Apple: 소셜 로그인 지원

    6. 수집한 개인정보의 보관 및 파기
회사는 서비스를 제공하는 동안 개인정보 취급방침 및 관련법에 의거하여  개인정보를 지속적으로 보관 및 관리합니다. 탈퇴 등으로 인해 개인정보 수집 및 이용목적이 달성된 경우, 수집된 개인정보는 즉시 또는 아래와 같이 일정 기간 후 파기됩니다.
    1) 학교, 학과, 학번, 프로필 사진을 포함한 개인 프로필 정보: 탈퇴시 즉시 파기
    2) 전송 및 수신된 시그널: 2주 후 파기
    3) 채팅 기록: 이용자 모두 채팅방을 나갈 시 파기
    4) 로그 기록: 최대 3년
    5) 신고 내역: 최대 3년 
※위 항에도 불구하고 법령에 의해 개인정보를 보관할 경우, 해당 법령에서 정한 최대 기간만큼 저장합니다.
※개인정보 수집 및 이용 목적이 달성되지 않았을 경우, 개인정보 파기 요청은 처리되지 않습니다.
※파기된 개인정보는 복원될 수 없습니다.

    7. 정보 주체의 권리, 의무 및 행사
회원은 언제든지 [내 정보]를 위해 자신의 개인정보를 조회하거나 수정, 삭제, 탈퇴 할 수 있습니다.
    8. 개인정보에 관한 책임자 및 서비스
회사는 회원의 개인정보를 최선으로 보호하고 관련된 불만을 처리하기 위해 권리침해신고센터를 운영하고 있습니다.
    1) 개인정보보호 담당 부서: 권리침해신고센터
    2) 책임자: 김현우
    3) 연락처: campusmeetask@gmail.com
기타 개인정보침해에 대한 신고나 상담이 필요한 경우 아래 기관에 문의하시길 바랍니다.
    1)  개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
    2)  개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
    3)  대검찰청 : (국번없이) 1301 (www.spo.go.kr)
    4)  경찰청 : (국번없이) 182 (cyberbureau.police.go.kr)


    9. 기타
본 약관은 2021년 8월 18일 최신화되었습니다.
`;


export const privacyPolicy = `제1조(목적)

캠퍼스밋 서비스 이용약관은 회사가 서비스를 제공함에 있어, 회사와 이용자간의 권리, 의무 및 책임 사항 등을 규정함을 목적으로 합니다.

제2조(정의)

    1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
    • “회사”란, 서비스를 제공하는 주체를 말합니다.
    • “서비스”란, 회사가 제공하는 모든 서비스 및 기능을 말합니다.
    • “이용자”란, 이 약관에 따라 서비스를 이용하는 회원 및 비회원을 말합니다.
    • “회원”이란, 서비스에 회원등록을 하고 이용하는 자를 말합니다.
    • “비회원”이란, 서비스에 회원등록을 하지 않고 서비스를 이용하는 자를 말합니다.
    • “게시판”이란, 게시물을 게시할 수 있는 공간을 말합니다.
    • “이용 기록”이란, 이용자가 서비스를 이용하면서 활동한 시그널, 채팅, 게시글, 댓글 등을 말합니다.
    • “학교인증”이란, 이용자가 학교 메일을 통해 진행한 학적 확인 절차를 말합니다.
    2. 1항에서 정의되지 않은 약관 내 용어의 의미는 일반적인 이용관행에 의합니다.

제3조(약관 등의 명시와 설명 및 개정)

    1. 회사는 이 약관을 회원가입 화면 및 “마이페이지” 메뉴 등에 게시합니다.
    2. 회사는 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
    3. 회원은 약관의 일부분만을 동의 또는 거절할 수 없습니다.
    4. 비회원이 이 서비스를 이용할 경우 이 약관에 동의한 것 으로 간주합니다.

제4조(서비스의 제공)

    1. 회사는 다음 서비스를 제공합니다.
    2. 회사는 운영상, 기술상의 필요에 따라 제공하고 있는 서비스를 변경할 수 있습니다.
    3. 회사는 이용자의 개인정보 및 서비스 이용 기록에 따라 서비스 이용에 차이를 둘 수 있습니다.
    4. 회사는 천재지변, 경영 악화, 인터넷 장애 등으로 서비스를 더 이상 제공하기 어려울 경우 서비스를 통보 없이 중단할 수 있습니다.
    5. 회사는 1항부터 전항까지와 다음 내용으로 발생한 피해에 대해 어떤 책임도 지지 않습니다.
        a. 모든 서비스, 게시물, 이용 기록의 진본성, 무결성, 신뢰성, 이용가능성
        b. 서비스 이용 중 타인과 상호간에 합의한 내용
        c. 게시물, 광고의 버튼, 하이퍼링크 등 외부로 연결된 서비스와 같이 회사가 제공하지 않은 컨텐츠에서 발생한 피해
        d. 이용자의 귀책 사유 또는 회사의 귀책 사유가 아닌 사유로 발생한 이용자의 피해

제5조(서비스 이용계약의 성립)

    1. 회사와 회원의 서비스 이용계약은  필수 약관에 동의한다는 의사표시를 한 비회원의 이용신청에 대하여, 서비스 화면에 이용승낙을 표시하는 방법 등으로 의사표시를 하면서 서비스 내부의 회원가입 화면의 기입 양식에 따라 회원정보를 기입한 후 체결됩니다.
    2. 회사는 부정사용방지 및 본인확인을 위해 회원에게 본인 인증 및 학교 인증을 요구할 수 있습니다.

제6조(개인정보의 관리 및 보호)

    1. 회원이 회사와 체결한 서비스 이용계약은 처음 이용계약을 체결한 본인에 한해 적용됩니다.
    2. 회원은 회원가입 시 등록한 정보에 변동이 있을 경우, 즉시 “마이페이지” 메뉴 등을 이용하여 정보를 최신화해야 합니다.
    3. 회원의 아이디, 비밀번호, 이메일 등의 모든 개인정보의 관리책임은 본인에게 있으므로, 타인에게 양도 및 대여할 수 없으며, 유출되지 않도록 관리해야 합니다. 만약 본인의 아이디 및 비밀번호를 타인이 사용하고 있음을 인지했을 경우 바로 회사 내부의 문의하여야 하고 안내가 있는 경우 이에 즉시 따라야 합니다.
    4. 회사는 2항부터 전항까지를 이행하지 않아 발생한 피해에 대해 어떤 책임도 지지 않습니다.

제7조(서비스 이용계약의 종료)

    1. 회원은 언제든지 본인의 계정으로 로그인한 뒤 서비스 내부의 “탈퇴하기” 버튼을 누르는 방법으로 탈퇴를 요청할 수 있으며, 문의를 통한 탈퇴 요청 등은 처리되지 않습니다. 회사는 해당 요청을 확인한 후 탈퇴를 처리합니다.
    2. 탈퇴처리가 완료되었더라도, 회원이 게시한 게시물 및 채팅기록은 삭제되지 않습니다.
    3. 회사는 회원이 연속하여 1년동안 로그인을 하지 않을 경우, 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
    4. 회사는 천재지변, 테러, 경영 악화 등 불가피한 사유로 더 이상 서비스를 제공할 수 없을 경우, 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
    5. 회사는 1항부터 전항까지로 인해 발생한 피해에 대해 어떠한 책임을 지지 않습니다.

제8조(저작권의 귀속)

    1. 회사가 작성한 게시물에 대한 권리는 회사에게 귀속되며, 회원이 작성한 게시물에 대한 권리는 회원에게 귀속됩니다. 단, 회사는 서비스의 운영, 확장, 홍보 등의 필요한 목적으로 회원의 저작물을 합리적이고 필요한 범위 내에서 별도의 허락 없이 수정하여 무상으로 사용하거나 제휴사에게 제공할 수 있습니다. 이 경우, 회원의 개인정보는 제공하지 않습니다.
    2. 회사는 전항 이외의 방법으로 회원의 게시물을 이용할 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용하여 회원의 동의를 받아야 합니다.

제9조(게시물의 게시 중단)

    1. 회사는 관련법에 의거하여 회원의 게시물로 인한 법률상 이익 침해를 근거로, 다른 이용자 또는 제 3자가 회원 또는 회사를 대상으로 하여 민형사상의 법정 조치를 취하거나 관련된 게시중단을 요청하는 경우, 회사는 해당 게시물에 대한 접근을 잠정적으로 제한하거나 삭제할 수 있습니다.

제10조(금지행위)

    1. 이용자는 다음과 같은 행위를 해서는 안됩니다.
        a. 개인정보 또는 계정 기만, 침해, 공유 행위
            i. 개인정보를 허위, 누락, 오기, 도용하여 작성하는 행위
            ii. 타인의 개인정보 및 계정을 수집, 저장, 공개, 이용하는 행위
            iii. 자신과 타인의 개인정보를 제3자에게 공개, 양도하는 행위
            iv. 다중 계정을 생성 및 이용하는 행위
            v. 자신의 계정을 이용하여 타인의 요청을 이행하는 행위
        b. 시스템 부정행위
            i. 허가하지 않은 방식의 서비스 이용 행위
            ii. 회사의 모든 재산에 대한 침해 행위
        c. 업무 방해 행위
            i. 서비스 관리자 또는 이에 준하는 자격을 사칭하거나 허가없이 취득하여 직권을 행사하는 행위
            ii. 회사 및 타인의 명예를 손상시키거나 업무를 방해하는 행위
            iii. 이 약관, 개인정보 처리 방침, 커뮤니티 이용규칙에서 이행 및 비이행을 명시한 내용에 반하는 행위
            iv. 기타 현행법에 어긋나거나 부적절하다고 판단되는 행위
    2. 이용자가 1항에 해당하는 행위를 할 경우, 회사는 다음과 같은 조치를 영구적으로 취할 수 있습니다.
        a. 이용자의 서비스 이용 권한, 자격, 혜택 제한 및 회수
        b. 회원과 체결된 이용계약을 회원의 동의나 통보 없이 파기
        c. 회원의 게시글, 이용기록을 임의로 삭제, 중단, 변경
        d. 그 외 회사가 필요하다고 판단되는 조치
    3. 회사는 1항부터 전항까지로 인해 발생하는 피해에 대해 어떠한 책임도 지지 않으며 이용자는 귀책사유로 인해 발생한 모든 손해를 배상할 책임이 있습니다.

제11조(신고를 통한 컨텐츠 차단)
    1. 이용자는 게시글, 댓글, 대댓글 등의 컨텐츠를 부적절하다고 판단할 시 ‘신고하기’ 기능을 통하여 신고할 수 있습니다.
    2. 하루 내에 5번 이상 신고를 받은 경우 즉시 ‘보류’ 상태로 처리되며 ‘보류’ 상태의 컨텐츠는 더 이상 서비스에 노출되지 않습니다.
    3. ‘보류’ 상태의 컨텐츠는 관리자의 판단 하에 앱에 복원될 수 있습니다.

제12조(기타)

    1. 이 약관은 2021년 8월 18일에 최신화 되었습니다.
    2. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 관련법 또는 관례에 따릅니다.
    3. 이 약관에도 불구하고 다른 약관이나 서비스 이용 중 안내 문구 등으로 달리 정함이 있는 경우에는 해당 내용을 우선으로 합니다.

`;
